posts/blas/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>BLAS | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="zh_cn" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/blas/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../extending-python-with-c/" title="Extending Python with C" type="text/html">
<link rel="next" href="../arpack/" title="arpack" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="BLAS">
<meta property="og:url" content="https://chimez.github.io/posts/blas/">
<meta property="og:description" content="BLAS


MKL 中的 BLAS，参考 MKL - BLAS
标准的 BLAS 参考 netlib - BLAS




BLAS 的命名规则


BLAS 中的函数名一般规则是 &lt;character&gt;&lt;name&gt;&lt;mode&gt; ()


&lt;character&gt; 指明数据类型

s real, single precision
c complex, single precision
d real">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-07T11:47:35+08:00">
<meta property="article:tag" content="BLAS">
<meta property="article:tag" content="C">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">源文件</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">BLAS</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-07T11:47:35+08:00" itemprop="datePublished" title="2021-05-07 11:47">2021-05-07 11:47</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">源文件</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org44138d1" class="outline-2">
<h2 id="org44138d1">BLAS</h2>
<div class="outline-text-2" id="text-org44138d1">
<ul class="org-ul">
<li>MKL 中的 BLAS，参考 <a href="https://software.intel.com/content/www/us/en/develop/documentation/onemkl-developer-reference-c/top/blas-and-sparse-blas-routines/blas-routines/naming-conventions-for-blas-routines.html">MKL - BLAS</a>
</li>
<li>标准的 BLAS 参考 <a href="https://www.netlib.org/blas/">netlib - BLAS</a>
</li>
</ul>
</div>

<div id="outline-container-orgefb64b5" class="outline-3">
<h3 id="orgefb64b5">BLAS 的命名规则</h3>
<div class="outline-text-3" id="text-orgefb64b5">
<p>
BLAS 中的函数名一般规则是 <code>&lt;character&gt;&lt;name&gt;&lt;mode&gt; ()</code>
</p>
<ul class="org-ul">
<li>
<code>&lt;character&gt;</code> 指明数据类型
<ul class="org-ul">
<li>
<code>s</code> real, single precision</li>
<li>
<code>c</code> complex, single precision</li>
<li>
<code>d</code> real, double precision</li>
<li>
<code>z</code> complex, double precision</li>
</ul>
</li>
<li>
<code>&lt;name&gt;</code> 指明矩阵类型 BLAS 2 and 3
<ul class="org-ul">
<li>
<code>ge</code> general matrix</li>
<li>
<code>gb</code> general band matrix</li>
<li>
<code>sy</code> symmetric matrix</li>
<li>
<code>sp</code> symmetric matrix (packed storage)</li>
<li>
<code>sb</code> symmetric band matrix</li>
<li>
<code>he</code> hermitian matrix</li>
<li>
<code>hp</code> hermitian matrix (packed storage)</li>
<li>
<code>hb</code> hermitian band matrix</li>
<li>
<code>tr</code> triangular matrix</li>
<li>
<code>tp</code> triangular matrix (packed storage)</li>
<li>
<code>tb</code> triangular band matrix</li>
</ul>
</li>
<li>
<code>&lt;mod&gt;</code> 指明操作的细节
<ul class="org-ul">
<li>
<code>c</code> conjugated vector</li>
<li>
<code>u</code> unconjugated vector</li>
<li>
<code>g</code> Givens rotation construction</li>
<li>
<code>m</code> modified Givens rotation</li>
<li>
<code>mg</code> modified Givens rotation construction</li>
<li>
<code>mv</code> matrix-vector product</li>
<li>
<code>sv</code> solving a system of linear equations with a single unknown vector</li>
<li>
<code>r</code> rank-1 update of matrix</li>
<li>
<code>r2</code> rank-2 update of matrix</li>
<li>
<code>mm</code> matrix-matrix product</li>
<li>
<code>sm</code> solving a system of linear equations with multiple unkonwn vectors</li>
<li>
<code>rk</code> rank-k update of matrix</li>
<li>
<code>r2k</code> rank-2k update of a matrix</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org081b0e9" class="outline-3">
<h3 id="org081b0e9">CBLAS 约定</h3>
<div class="outline-text-3" id="text-org081b0e9">
<p>
CBLAS 是 BLAS 的 c 接口， BLAS 是 fortran 标准。
</p>

<p>
CBLAS 函数都遵循以下约定
</p>

<ul class="org-ul">
<li>输入参数是 <code>const</code> 指针</li>
<li>非复数标量输入参数传值</li>
<li>复标量参数传 <code>void</code> 指针</li>
<li>数组参数传地址</li>
<li>BLAS 特征参数由适当的枚举类型代替</li>
<li>level 2 和 level 3 需要一个额外的 <code>CBLAS_LAYOUT</code> 类型的参数来指定矩阵是行优先 <code>CblasRowMajor</code> 还是列优先 <code>CblasColMajor</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9455ed1" class="outline-3">
<h3 id="org9455ed1">枚举类型</h3>
<div class="outline-text-3" id="text-org9455ed1">
<div class="highlight"><pre><span></span><span class="w">   </span><span class="k">enum</span><span class="w"> </span><span class="n">CBLAS_LAYOUT</span><span class="w"> </span><span class="p">{</span>
<span class="w">      </span><span class="n">CblasRowMajor</span><span class="o">=</span><span class="mi">101</span><span class="p">,</span><span class="w">    </span><span class="cm">/* row-major arrays */</span>
<span class="w">      </span><span class="n">CblasColMajor</span><span class="o">=</span><span class="mi">102</span><span class="p">};</span><span class="w">   </span><span class="cm">/* column-major arrays */</span>

<span class="w">   </span><span class="k">enum</span><span class="w"> </span><span class="n">CBLAS_TRANSPOSE</span><span class="w"> </span><span class="p">{</span>
<span class="w">      </span><span class="n">CblasNoTrans</span><span class="o">=</span><span class="mi">111</span><span class="p">,</span><span class="w">     </span><span class="cm">/* trans='N' */</span>
<span class="w">      </span><span class="n">CblasTrans</span><span class="o">=</span><span class="mi">112</span><span class="p">,</span><span class="w">       </span><span class="cm">/* trans='T' */</span>
<span class="w">      </span><span class="n">CblasConjTrans</span><span class="o">=</span><span class="mi">113</span><span class="p">};</span><span class="w">  </span><span class="cm">/* trans='C' */</span>

<span class="w">   </span><span class="k">enum</span><span class="w"> </span><span class="n">CBLAS_UPLO</span><span class="w"> </span><span class="p">{</span>
<span class="w">      </span><span class="n">CblasUpper</span><span class="o">=</span><span class="mi">121</span><span class="p">,</span><span class="w">        </span><span class="cm">/* uplo ='U' */</span>
<span class="w">      </span><span class="n">CblasLower</span><span class="o">=</span><span class="mi">122</span><span class="p">};</span><span class="w">       </span><span class="cm">/* uplo ='L' */</span>

<span class="w">   </span><span class="k">enum</span><span class="w"> </span><span class="n">CBLAS_DIAG</span><span class="w"> </span><span class="p">{</span>
<span class="w">      </span><span class="n">CblasNonUnit</span><span class="o">=</span><span class="mi">131</span><span class="p">,</span><span class="w">      </span><span class="cm">/* diag ='N' */</span>
<span class="w">      </span><span class="n">CblasUnit</span><span class="o">=</span><span class="mi">132</span><span class="p">};</span><span class="w">        </span><span class="cm">/* diag ='U' */</span>

<span class="w">   </span><span class="k">enum</span><span class="w"> </span><span class="n">CBLAS_SIDE</span><span class="w"> </span><span class="p">{</span>
<span class="w">      </span><span class="n">CblasLeft</span><span class="o">=</span><span class="mi">141</span><span class="p">,</span><span class="w">         </span><span class="cm">/* side ='L' */</span>
<span class="w">      </span><span class="n">CblasRight</span><span class="o">=</span><span class="mi">142</span><span class="p">};</span><span class="w">       </span><span class="cm">/* side ='R' */</span>
</pre></div>
</div>
</div>

<div id="outline-container-orgaf5c2c8" class="outline-3">
<h3 id="orgaf5c2c8">矩阵存储方式</h3>
<div class="outline-text-3" id="text-orgaf5c2c8">
<ol class="org-ol">
<li>完全存储矩阵 \(A_{ij}_{}\) 在二维数组列存储 <code>a[i + j*lda]</code> 行存储 <code>a[i*lda + j]</code>
</li>
<li>packed storage 可以用更有效的方式存储矩阵</li>
</ol>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/blas/" rel="tag">BLAS</a></li>
            <li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../extending-python-with-c/" rel="prev" title="Extending Python with C">上一篇文章</a>
            </li>
            <li class="next">
                <a href="../arpack/" rel="next" title="arpack">下一篇文章</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2023         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
